Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: Sometimes, however, it isn't feasible to arrange that kind of environment.
it_it: A volte, però, non è possibile organizzare questo tipo di ambiente.

source: Sometimes, however, multiple test cases may want to use the same or slightly different fixtures.
it_it: A volte, tuttavia, più casi di test potrebbero voler utilizzare le stesse fixture o leggermente diverse.

source: Sometimes, however, we may want to be more explicit about the types.
it_it: A volte, tuttavia, potremmo voler essere più espliciti riguardo ai tipi.

source: Sometimes, however, you know what you're doing and want the compiler to give you some slack.
it_it: A volte, però, sapendo cosa si fa, si vuole che il compilatore dia un po' di tregua.

source: Sometimes, though, you may want to be more flexible (for example, the first element must be an exact match, but the second element can be any positive number, and so on).
it_it: A volte, però, si necessita di una maggiore flessibilità (ad esempio, il primo elemento deve corrispondere esattamente, ma il secondo elemento può essere qualsiasi numero positivo e così via).

source: Sometimes, you may want all the expected calls to occur in a strict order.
it_it: A volte, si vuole che tutte le chiamate previste avvengano in un ordine rigoroso.

source: Sometimes, you may want to change this default value, or you may want to specify a default value for types gMock doesn't know about.
it_it: A volte, si vuole modificare questo valore di default o specificare un valore di default per i tipi di cui gMock non è a conoscenza.

source: Specifies how many times the mock function call is expected.
it_it: Specifica quante volte è prevista la chiamata alla funzione mock.

source: Specifies that the mock function call is expected in a certain sequence.
it_it: Specifica che la chiamata alla funzione mock è prevista in una determinata sequenza.

source: Specifies that the mock function call is expected to occur after one or more other calls.
it_it: Specifica che ci si aspetta che la chiamata alla funzione mock avvenga dopo una o più altre chiamate.

source: Specifies the default behavior of a matching mock function call.
it_it: Specifica il comportamento di default di una chiamata di funzione mock corrispondente [match].

source: Specifies the mock function's actual behavior when invoked, for a single matching function call.
it_it: Specifica il comportamento effettivo della funzione mock quando richiamata, per una singola chiamata di funzione corrispondente [matching].

source: Specifies the mock function's actual behavior when invoked, for all subsequent matching function calls.
it_it: Specifica il comportamento effettivo della funzione mock quando richiamata, per tutte le successive chiamate di funzione corrispondenti [match].

source: Specify your expectations on them (How many times will a method be called?
it_it: Si specificano le [expectation] aspettative su di essi (quante volte verrà chiamato un metodo?

source: Specifying Calling Conventions for Mock Functions
it_it: Specificare le Convenzioni di Chiamata per le Funzioni Mock

source: Specifying Names for Value-Parameterized Test Parameters
it_it: Specificare i Nomi per i Parametri di test con Valori Parametrizzati

source: Splitting up the test case would require multiple set-up and tear-down processes, which is inefficient and makes the semantics unclean.
it_it: La suddivisione del test case richiederebbe più processi di set-up e tear-down, il che è inefficiente e rende la semantica impura.

source: Start its body with protected:, as we'll want to access fixture members from sub-classes.
it_it: Il body inizia con protected:, per accedere ai membri della fixture dalle sottoclassi.

source: Start its body with `protected:`, as we'll want to access fixture members from sub-classes.
it_it: Il body inizia con `protected:`, per accedere ai membri della fixture dalle sottoclassi.

source: Static functions ( *not* the same as static member functions!) or unnamed namespaces, and
it_it: Le funzioni statiche (*non* è lo stesso delle funzioni membro statiche!) o i namespace anonimi, e

source: Static functions ( not the same as static member functions!) or unnamed namespaces, and
it_it: Le funzioni statiche ( non è lo stesso delle funzioni membro statiche!) o i namespace anonimi, e

source: Steps #3 and #4 can be done either in one thread or in multiple threads - anyway you want.
it_it: I passi #3 e #4 possono essere eseguiti in un thread o in più thread, - come si vuole.

source: Stop test execution upon first failure
it_it: Interrompere l'esecuzione del test al primo errore

source: Stores information about a test.
it_it: Memorizza le informazioni su un test.

source: StrictMock<MockClass> my_mock("some", "args"); EXPECT_CALL(my_mock, DoSomething()); ... code that uses my_mock ...
it_it: StrictMock<MockClass> my_mock("some", "args"); EXPECT_CALL(my_mock, DoSomething()); ... codice che usa uses my_mock ...

source: StrictMock<MockFoo> strict_foo; // The type is a subclass of MockFoo.
it_it: StrictMock<MockFoo> strict_foo; // Il tipo è una sottoclasse di MockFoo.

source: String Comparison {#c-strings}
it_it: Confronto tra Stringhe {#c-strings}

source: String Matchers
it_it: Matcher di Stringhe

source: Subroutine(); // The intended behavior is for the fatal failure
it_it: Subroutine(); // Il comportamento previsto è che l'errore fatale

source: Such cleverness also leads to Heisenbugs.
it_it: Tale intelligenza porta anche agli Heisenbugs.

source: Such cleverness also leads to [Heisenbugs](https://en.wikipedia.org/wiki/Heisenbug).
it_it: Tale intelligenza porta anche agli [Heisenbugs](https://en.wikipedia.org/wiki/Heisenbug).

source: Such consistency is especially helpful when people switch projects and start to work on a new code base.
it_it: Tale coerenza è particolarmente utile quando si cambia progetto e si inizia a lavorare su una nuova base di codice.

source: Such is called the Pimpl (Private Implementation) idiom.
it_it: Questo è chiamato idioma Pimpl (Private Implementation).

source: Such is called the [Pimpl](https://www.gamedev.net/articles/programming/general-and-gameplay-programming/the-c-pimpl-r1794/) (Private Implementation) idiom.
it_it: Questo è chiamato idioma [Pimpl](https://www.gamedev.net/articles/programming/general-and-gameplay-programming/the-c-pimpl-r1794/) (Private Implementation).

source: Suddenly you have to update all your golden images.).
it_it: All'improvviso si devono aggiornare tutte le immagini campione).

source: Support for move-only function arguments was only introduced to gMock in April of 2017.
it_it: Il supporto per gli argomenti move-only di funzioni è stato introdotto in gMock solo nell'aprile del 2017.

source: Supported Platforms
it_it: Piattaforme Supportate

source: Supported Platforms:
it_it: Piattaforme Supportate:

source: Supported PlatformsX:
it_it: Piattaforme Supportate:

source: Suppose the parameter is named param, you can also use the gMock-defined symbol param_type to refer to the type of the parameter as inferred by the compiler.
it_it: Supponiamo che il parametro si chiami param, si può anche utilizzare il simbolo definito da gMock param_type per fare riferimento al tipo del parametro come dedotto dal compilatore.

source: Suppose there's a bug in that code and it doesn't delete the mock object properly - you could end up with a passing test when there's actually a bug.
it_it: Supponiamo che ci sia un bug in quel codice e che non si effettui correttamente il delete dell'oggetto mock: si potrebbe finire con un test positivo quando in realtà c'è un bug.

source: Suppose turtle.GoTo(0, 0) is called three times.
it_it: Supponiamo che turtle.GoTo(0, 0) sia chiamata tre volte.

source: Suppose `turtle.GoTo(0, 0)` is called three times.
it_it: Supponiamo che `turtle.GoTo(0, 0)` sia chiamata tre volte.

source: Suppose the bug is that the "c" in the third EXPECT_CALL is a typo and should actually be "a".
it_it: Supponiamo che il bug sia che la "c" nella terza EXPECT_CALL sia un errore di battitura e in realtà dovrebbe essere "a".

source: Suppose the bug is that the `"c"` in the third `EXPECT_CALL` is a typo and should actually be `"a"`.
it_it: Supponiamo che il bug sia che la `"c"` nella terza `EXPECT_CALL` sia un errore di battitura e in realtà dovrebbe essere `"a"`.

source: Suppose the parameter is named `param`, you can also use the gMock-defined symbol `param_type` to refer to the type of the parameter as inferred by the compiler.
it_it: Supponiamo che il parametro si chiami `param`, si può anche utilizzare il simbolo definito da gMock `param_type` per fare riferimento al tipo del parametro come dedotto dal compilatore.

source: Suppose you are developing a graphics program that relies on a LOGO-like API for drawing.
it_it: Supponiamo che si stia sviluppando un programma di grafica che si basa su un'API simile a LOGO per il disegno.

source: Suppose you are developing a graphics program that relies on a [LOGO](https://en.wikipedia.org/wiki/Logo_programming_language)-like API for drawing.
it_it: Supponiamo che si stia sviluppando un programma di grafica che si basa su un'API simile a [LOGO](https://en.wikipedia.org/wiki/Logo_programming_language) per il disegno.

source: Suppose you had a EventQueue class that you wanted to test, and you created a separate EventDispatcher interface so that you could easily mock it out.
it_it: Supponiamo di avere una classe EventQueue da testare e che sia stata creata un'interfaccia EventDispatcher separata in modo da poterla facilmente renderla mock.

source: Suppose you had a `EventQueue` class that you wanted to test, and you created a separate `EventDispatcher` interface so that you could easily mock it out.
it_it: Supponiamo di avere una classe `EventQueue` da testare e che sia stata creata un'interfaccia `EventDispatcher` separata in modo da poterla facilmente renderla mock.

source: Suppose you have 3 machines at your disposal.
it_it: Supponiamo di avere 3 macchine a nostra disposizione.

source: Suppose you have a test program foo_test that contains the following 5 test functions:
it_it: Supponiamo di avere un programma di test foo_test che contiene le seguenti 5 funzioni di test:

source: Suppose you have a test program `foo_test` that contains the following 5 test functions:
it_it: Supponiamo di avere un programma di test `foo_test` che contiene le seguenti 5 funzioni di test:

source: Suppose you have an action factory IncrementCounter(init) which creates an action that increments and returns a counter whose initial value is init, using two actions created from the same expression and using a shared action will exhibit different behaviors.
it_it: Supponiamo di avere una action factory IncrementCounter(init) che crea un'azione che incrementa e restituisce un contatore il cui valore iniziale è init, utilizzando due azioni create dalla stessa espressione e utilizzando un'azione condivisa mostrerà comportamenti diversi.

source: Suppose you have an action factory `IncrementCounter(init)` which creates an action that increments and returns a counter whose initial value is `init`, using two actions created from the same expression and using a shared action will exhibit different behaviors.
it_it: Supponiamo di avere una action factory `IncrementCounter(init)` che crea un'azione che incrementa e restituisce un contatore il cui valore iniziale è `init`, utilizzando due azioni create dalla stessa espressione e utilizzando un'azione condivisa mostrerà comportamenti diversi.

source: Suppose you have multiple implementations of the same interface and want to make sure that all of them satisfy some common requirements.
it_it: Supponiamo di avere più implementazioni della stessa interfaccia e di voler assicurarci che tutte soddisfino alcuni requisiti comuni.

source: Suppose your test uses a mock class MockFoo:
it_it: Supponiamo che il test utilizzi una classe mock MockFoo:

source: Suppose your test uses a mock class `MockFoo`:
it_it: Supponiamo che il test utilizzi una classe mock `MockFoo`:

source: Suppressing UTF-8 Text Output
it_it: Sopprimere l'Output di Testo UTF-8

source: Suppressing test passes
it_it: Sopprimere i test superati

source: Suppressing the Elapsed Time
it_it: Sopprimere il Tempo Trascorso

source: T MakeT(); DefaultValue<T>::SetFactory(&MakeT); // Unsets the default value.
it_it: T MakeT(); DefaultValue<T>::SetFactory(&MakeT); // Annulla il valore di default.

source: T must be copy constructible.
it_it: T deve avere un costruttore copia.

source: T must be move constructible.
it_it: deve avere un costruttore di spostamento [move].

source: TEST(FooTest, DISABLED_DoesAbc) { ... } class DISABLED_BarTest : public testing::Test { ... }; // Tests that Bar does Xyz.
it_it: TEST(FooTest, DISABLED_DoesAbc) { ... } class DISABLED_BarTest : public testing::Test { ... }; // Verifica che Bar esegua Xyz.

source: TEST_F(FooTest, Bar) { ... } TEST_F(FooTest, Baz) { ... } ... additional fixtures derived from BaseTest ...
it_it: TEST_F(FooTest, Bar) { ... } TEST_F(FooTest, Baz) { ... } ... fixture aggiuntive derivate da BaseTest ...

source: TYPED_TEST_SUITE_P(MyFixture); TYPED_TEST_P(MyFixture, HasPropertyA) { ... } TYPED_TEST_P(MyFixture, HasPropertyB) { ... } // Register the tests in the test suite.
it_it: TYPED_TEST_SUITE_P(MyFixture); TYPED_TEST_P(MyFixture, HasPropertyA) { ... } TYPED_TEST_P(MyFixture, HasPropertyB) { ... } // Registra i test nella test suite.

source: Take a *virtual* function of `Turtle` (while it's possible to [mock non-virtual methods using templates](gmock_cook_book.md#MockingNonVirtualMethods), it's much more involved).
it_it: Prendere una funzione *virtual* di `Turtle` (sebbene sia possibile ["mock-are" metodi non-virtuali utilizzando i template](gmock_cook_book.md#MockingNonVirtualMethods), è molto più complicato).

source: Take a virtual function of Turtle (while it's possible to mock non-virtual methods using templates, it's much more involved).
it_it: Prendere una funzione virtual di Turtle (sebbene sia possibile "mock-are" metodi non-virtuali utilizzando i template, è molto più complicato).

source: Takes effect after the actions specified in the WillOnce clauses, if any, have been performed.
it_it: Ha effetto dopo l'esecuzione delle action specificate nelle clausole WillOnce, se presenti.

source: Takes effect after the actions specified in the [`WillOnce`](#EXPECT_CALL.WillOnce) clauses, if any, have been performed.
it_it: Ha effetto dopo l'esecuzione delle action specificate nelle clausole [`WillOnce`](#EXPECT_CALL.WillOnce), se eseguite.

source: Teaching GoogleTest How to Print Your Values
it_it: Insegnare a GoogleTest Come Stampare i Propri Valori

source: Teaching gMock How to Print Your Values
it_it: Insegnare a gMock Come Stampare i Propri Valori

source: Technically, all matchers match a *single* value.
it_it: Tecnicamente, tutti i matcher corrispondono a un *singolo* valore.

source: Technically, all matchers match a single value.
it_it: Tecnicamente, tutti i matcher corrispondono a un singolo valore.

source: Temporarily Disabling Tests
it_it: Disattivazione Temporanea dei Test

source: Temporarily Enabling Disabled Tests
it_it: Abilitazione Temporanea dei Test Disabilitati

source: Temporarily disabling tests
it_it: Disattivazione temporanea dei test

source: Test Fixtures: Using the Same Data Configuration for Multiple Tests {#same-data-multiple-tests}
it_it: Test Fixture: Uso della Stessa Configurazione dei Dati per Più Test {#same-data-multiple-tests}

source: Test fixtures can be reused via subclassing, which cannot be done easily with global variables.
it_it: Le fixture possono essere riutilizzate tramite sottoclassi, cosa che non può essere eseguita facilmente con le variabili globali.

source: Test suites with a name ending in "DeathTest" are run before all other tests.
it_it: Le test suite con un nome che termina con "DeathTest" vengono eseguite prima di tutti gli altri test.

source: TestInfo contains the state of a test, and
it_it: TestInfo contiene lo stato di un test e

source: TestPartResult represents the result of a test assertion.
it_it: TestPartResult rappresenta il risultato di un'asserzione di un test.

source: TestSuite has information about a test suite, which can contain one or more tests,
it_it: TestSuite contiene informazioni su una test suite, che può contenere uno o più test,

source: Testing Asynchronous Behavior
it_it: Testare il Comportamento Asincrono

source: Testing FAQ
it_it: FAQ sul Testing

source: Testing Private Code
it_it: Test di Codice Privato

source: Testing Reference
it_it: Riferimento al Testing

source: Tests using the fixture can then access the private members of your production class via the accessors in the fixture.
it_it: I test che utilizzano la fixture possono poi accedere ai membri privati della classe di produzione tramite gli accessori nella fixture.

source: Tests from different test suites can have the same individual name.
it_it: I test di diverse test suite possono avere lo stesso nome individuale.

source: Tests in different test suites can have the same individual name.
it_it: I test in diverse test suite possono avere lo stesso nome individuale.

source: Tests should be *fast*.
it_it: I test dovrebbero essere *veloci*.

source: Tests should be *independent* and *repeatable*.
it_it: I test dovrebbero essere *independenti* e *ripetibili*.

source: Tests should be *portable* and *reusable*.
it_it: I test dovrebbero essere *portabili* e *riutilizzabili*.

source: Tests should be fast.
it_it: I test dovrebbero essere veloci.

source: Tests should be independent and repeatable.
it_it: I test dovrebbero essere independeni e ripetibili.

source: Tests should be portable and reusable.
it_it: I test dovrebbero essere portabili e riutilizzabili.

source: Tests should be well *organized* and reflect the structure of the tested code.
it_it: I test dovrebbero essere ben *organizzati* e riflettere la struttura del codice testato.

source: Tests should be well organized and reflect the structure of the tested code.
it_it: I test dovrebbero essere ben organizzati e riflettere la struttura del codice testato.

source: Tests written this way are much more robust (they won't break because your new machine does anti-aliasing differently), easier to read and maintain (the intent of a test is expressed in the code, not in some binary images), and run much, much faster.
it_it: I test scritti in questo modo sono molto più robusti (non si romperanno perché la nuova macchina esegue l'anti-aliasing in modo diverso), sono più facili da leggere e mantenere (l'intento di un test è espresso nel codice, non in alcune immagini binarie) e si gira molto, molto più velocemente.

source: Tests written this way are much more robust (they won't break because your new machine does anti-aliasing differently), easier to read and maintain (the intent of a test is expressed in the code, not in some binary images), and run *much, much faster*.
it_it: I test scritti in questo modo sono molto più robusti (non si romperanno perché la nuova macchina esegue l'anti-aliasing in modo diverso), sono più facili da leggere e mantenere (l'intento di un test è espresso nel codice, non in alcune immagini binarie) e si gira *molto, molto più velocemente*.

source: That avoids race conditions and dead locks, and makes debugging your test much easier.
it_it: Ciò evita condizioni di "race" e "dead lock" e semplifica molto il debug del test.

source: That covers returning move-only values; but how do we work with methods accepting move-only arguments?
it_it: Ciò riguarda la restituzione di valori move-only; ma come lavoriamo con metodi che accettano argomenti move-only?

source: That hacky implementation has some ad hoc limitations.
it_it: Questa implementazione complicata presenta alcune limitazioni ad hoc.

source: That is, instead of
it_it: Cioè, invece di

source: That is, EXPECT_CALLs have their own precedence order distinct from the ON_CALL precedence order.
it_it: Cioè, le EXPECT_CALL hanno il proprio ordine di precedenza distinto da quello di ON_CALL.

source: That is, `EXPECT_CALL`s have their own precedence order distinct from the `ON_CALL` precedence order.
it_it: Cioè, le `EXPECT_CALL` hanno il proprio ordine di precedenza distinto da quello di `ON_CALL`.

source: That is, it runs all tests in one test suite first, and then runs all tests in the next test suite, and so on.
it_it: Cioè, esegue prima tutti i test in una test suite, poi esegue tutti i test nella test suite successiva e così via.

source: That is, unless you are not sure if your mock object will be destroyed.
it_it: Cioè, a meno che non si sia sicuri che l'oggetto mock verrà distrutto.

source: That means EXPECT_TRUE(ptr != NULL) works just as well.
it_it: Ciò significa che EXPECT_TRUE(ptr != NULL) funziona altrettanto bene.

source: That means `EXPECT_TRUE(ptr != NULL)` works just as well.
it_it: Ciò significa che `EXPECT_TRUE(ptr != NULL)` funziona altrettanto bene.

source: That means you can teach it to do a better job at printing your particular type than to dump the bytes.
it_it: Ciò significa che le si può insegnare a stampare un proprio tipo particolare piuttosto che eseguirne il dump dei byte.

source: That should workaround the VC bug.
it_it: Ciò dovrebbe risolvere il bug VC.

source: That's OK - you didn't say it's not OK to call the function!
it_it: Va bene: non è stato detto che non è OK chiamare la funzione!

source: That's fine as long as the test doesn't need to call it.
it_it: Va bene fin quando non è necessario che il test lo chiami.

source: That's fine.
it_it: Va bene.

source: That's it!
it_it: Questo è tutto!

source: That's just how C++ works.)
it_it: È così che funziona il C++).

source: That's not fun, so don't do it.
it_it: Questo non è bello, quindi non farlo.

source: That's not good.
it_it: Questo non è buono.

source: That's why the ZeroAndNegativeNos test uses only ASSERT_EQ while the PositiveNos test uses EXPECT_EQ to tell you how many cases there are where the square root function fails without aborting the test.
it_it: Ecco perché il test ZeroAndNegativeNos utilizza solo ASSERT_EQ mentre il test PositiveNos utilizza EXPECT_EQ per dire come ci sono molti casi in cui la funzione radice quadrata fallisce senza interrompere il test.

source: The Undefined Behavior Sanitizer, Address Sanitizer, and Thread Sanitizer all provide weak functions that you can override to trigger explicit failures when they detect sanitizer errors, such as creating a reference from nullptr.
it_it: Undefined Behavior Sanitizer, Address Sanitizer e Thread Sanitizer forniscono tutti funzioni deboli che si possono sovrascrivere [override] per sollevare errori espliciti quando rilevano errori di sanitizer, come la creazione di un riferimento da nullptr.

source: The TestInfo class has this information.
it_it: La classe TestInfo contiene queste informazioni.

source: The Death Tests And Threads section below explains why.
it_it: La seguente sezione I Death Test E i Thread spiega il perché.

source: The NanSensitive* version instead treats two NaNs as equal, which is often what a user wants.
it_it: La versione NanSensitive* tratta invece due NaN come uguali, che spesso è ciò che un utente desidera.

source: The destructor will automatically verify it.
it_it: Il distruttore lo verificherà automaticamente.

source: The details can be found here.)
it_it: I dettagli si trovano qui.)

source: The following example illustrates this for multiple parameters, an enumeration type and a string, and also demonstrates how to combine generators.
it_it: L'esempio seguente illustra questo per più parametri, un tipo di enumerazione e una stringa e mostra anche come combinare i generatori.
